nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
// Implementation of the ESP32 EVSE ESPHome component.  This file contains the
// UART protocol glue that synchronises charger state with the generated
// entities configured in YAML.
#include "esp32evse.h"

#include "esphome/core/helpers.h"
#include "esphome/core/log.h"

#include <algorithm>
#include <charconv>
#include <cctype>
#include <cmath>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <ctime>
#include <inttypes.h>
#include <limits>
#include <string>
#include <string_view>
#include <system_error>

namespace esphome {
namespace esp32evse {

static const char *const TAG = "esp32evse";

namespace {

constexpr uint32_t kDefaultUpdateIntervalMs = 60'000;
constexpr uint32_t kMinUpdateIntervalMs = 10'000;
constexpr uint32_t kMaxUpdateIntervalMs = 600'000;
constexpr size_t kRxChunkSize = 64;
constexpr size_t kMaxLineLength = 512;

// Utility: return a pointer to the substring that follows ``prefix`` if the
// incoming UART line starts with it.  Many EVSE responses follow a predictable
// ``KEY=VALUE`` structure, so this helper keeps the parsing code terse.
const char *value_after_prefix(const std::string &line, const char *prefix) {
  const size_t prefix_len = strlen(prefix);
  if (line.compare(0, prefix_len, prefix) != 0)
    return nullptr;
  size_t pos = prefix_len;
  if (pos < line.size() && (line[pos] == '=' || line[pos] == ':'))
    ++pos;
  while (pos < line.size() && isspace(static_cast<unsigned char>(line[pos])))
    ++pos;
  return line.c_str() + pos;
}

// Utility: trim whitespace and optional quotes from a string returned by the
// EVSE so we can forward clean values to downstream consumers.
std::string_view trim_view(const char *value) {
  if (value == nullptr)
    return {};
  std::string_view out(value);
  while (!out.empty() && isspace(static_cast<unsigned char>(out.front())))
    out.remove_prefix(1);
  while (!out.empty() && isspace(static_cast<unsigned char>(out.back())))
    out.remove_suffix(1);
  if (out.size() >= 2 && ((out.front() == '"' && out.back() == '"') ||
                          (out.front() == '\'' && out.back() == '\''))) {
    out.remove_prefix(1);
    out.remove_suffix(1);
  }
  return out;
}

std::string trim_copy(const char *value) { return std::string(trim_view(value)); }

std::string_view nth_trimmed_token(std::string_view input, size_t token_index,
                                   char delimiter = ',') {
  size_t start = 0;
  size_t current = 0;
  while (start <= input.size()) {
    size_t end = input.find(delimiter, start);
    if (end == std::string_view::npos)
      end = input.size();

    if (current == token_index) {
      std::string_view token = input.substr(start, end - start);
      while (!token.empty() && isspace(static_cast<unsigned char>(token.front())))
        token.remove_prefix(1);
      while (!token.empty() && isspace(static_cast<unsigned char>(token.back())))
        token.remove_suffix(1);
      if (token.size() >= 2 && ((token.front() == '"' && token.back() == '"') ||
                                (token.front() == '\'' && token.back() == '\''))) {
        token.remove_prefix(1);
        token.remove_suffix(1);
      }
      return token;
    }

    if (end == input.size())
      break;
    start = end + 1;
    ++current;
  }
  return {};
}

// Utility: parse the last floating point number contained in a response.
float parse_last_float(const char *input) {
  if (input == nullptr)
    return NAN;
  float result = NAN;
  const char *start = input;
  char *endptr = nullptr;
  while (*start != '\0') {
    float value = strtof(start, &endptr);
    if (endptr == start) {
      ++start;
      continue;
    }
    result = value;
    start = endptr;
  }
  return result;
}

}  // namespace

void ESP32EVSEComponent::CommandString::clear() {
  this->length_ = 0;
  this->buffer_[0] = '\0';
}

void ESP32EVSEComponent::CommandString::assign(const char *value) {
  this->clear();
  if (value == nullptr)
    return;
  size_t to_copy = std::min(strlen(value), MAX_LENGTH);
  if (to_copy > 0)
    memcpy(this->buffer_, value, to_copy);
  this->length_ = to_copy;
  this->buffer_[this->length_] = '\0';
}

void ESP32EVSEComponent::CommandString::append(const char *value) {
  if (value == nullptr)
    return;
  size_t remaining = MAX_LENGTH - this->length_;
  if (remaining == 0)
    return;
  size_t to_copy = std::min(strlen(value), remaining);
  if (to_copy > 0)
    memcpy(this->buffer_ + this->length_, value, to_copy);
  this->length_ += to_copy;
  this->buffer_[this->length_] = '\0';
}

void ESP32EVSEComponent::CommandString::append_char(char value) {
  if (this->length_ >= MAX_LENGTH)
    return;
  this->buffer_[this->length_++] = value;
  this->buffer_[this->length_] = '\0';
}

void ESP32EVSEComponent::CommandString::append_decimal(int32_t value) {
  if (this->length_ >= MAX_LENGTH)
    return;
  int written = snprintf(this->buffer_ + this->length_, MAX_LENGTH + 1 - this->length_, "%ld",
                         static_cast<long>(value));
  if (written <= 0)
    return;
  size_t consumed = std::min(static_cast<size_t>(written), MAX_LENGTH - this->length_);
  this->length_ += consumed;
  this->buffer_[this->length_] = '\0';
}

void ESP32EVSEComponent::CommandString::append_unsigned(uint32_t value) {
  if (this->length_ >= MAX_LENGTH)
    return;
  int written = snprintf(this->buffer_ + this->length_, MAX_LENGTH + 1 - this->length_, "%lu",
                         static_cast<unsigned long>(value));
  if (written <= 0)
    return;
  size_t consumed = std::min(static_cast<size_t>(written), MAX_LENGTH - this->length_);
  this->length_ += consumed;
  this->buffer_[this->length_] = '\0';
}

bool ESP32EVSEComponent::PendingCommandQueue::push_back(const PendingCommand &command) {
  if (this->size_ >= MAX_PENDING_COMMANDS)
    return false;
  this->commands_[this->size_] = command;
  ++this->size_;
  return true;
}

bool ESP32EVSEComponent::PendingCommandQueue::insert(size_t index, const PendingCommand &command) {
  if (this->size_ >= MAX_PENDING_COMMANDS)
    return false;
  if (index > this->size_)
    index = this->size_;
  for (size_t i = this->size_; i > index; --i) {
    this->commands_[i] = this->commands_[i - 1];
  }
  this->commands_[index] = command;
  ++this->size_;
  return true;
}

void ESP32EVSEComponent::PendingCommandQueue::pop_front() {
  if (this->size_ == 0)
    return;
  for (size_t i = 1; i < this->size_; ++i) {
    this->commands_[i - 1] = this->commands_[i];
  }
  --this->size_;
}

