nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
// Called once at boot to schedule initial state requests from the EVSE.
void ESP32EVSEComponent::setup() {
  ESP_LOGCONFIG(TAG, "Setting up ESP32 EVSE component");
  this->read_buffer_.reserve(kMaxLineLength);

  this->set_timeout(1000, [this]() {
    this->request_state_update();
    this->request_enable_update();
    this->request_pending_authorization_update();
    if (this->has_error_binary_sensors_())
      this->request_error_flags_update();

    if (this->temperature_high_sensor_ != nullptr || this->temperature_low_sensor_ != nullptr)
      this->request_temperature_update();
    if (this->charging_current_number_ != nullptr)
      this->request_charging_current_update();
    if (this->emeter_power_sensor_ != nullptr)
      this->request_emeter_power_update();
    if (this->emeter_session_time_sensor_ != nullptr)
      this->request_emeter_session_time_update();
    if (this->emeter_charging_time_sensor_ != nullptr)
      this->request_emeter_charging_time_update();
    if (this->uptime_sensor_ != nullptr)
      this->request_uptime_update();
    if (this->chip_text_sensor_ != nullptr)
      this->request_chip_update();
    if (this->version_text_sensor_ != nullptr)
      this->request_version_update();
    if (this->idf_version_text_sensor_ != nullptr)
      this->request_idf_version_update();
    if (this->build_time_text_sensor_ != nullptr)
      this->request_build_time_update();
    if (this->device_time_text_sensor_ != nullptr)
      this->request_device_time_update();
    if (this->wifi_sta_ssid_text_sensor_ != nullptr)
      this->request_wifi_sta_cfg_update();
    if (this->wifi_sta_ip_text_sensor_ != nullptr)
      this->request_wifi_sta_ip_update();
    if (this->wifi_sta_mac_text_sensor_ != nullptr)
      this->request_wifi_sta_mac_update();
    if (this->device_name_text_sensor_ != nullptr)
      this->request_device_name_update();
    if (this->available_switch_ != nullptr)
      this->request_available_update();
    if (this->request_authorization_switch_ != nullptr)
      this->request_request_authorization_update();
    if (this->emeter_three_phase_switch_ != nullptr)
      this->request_emeter_three_phase_update();
    if (this->heap_used_sensor_ != nullptr || this->heap_total_sensor_ != nullptr)
      this->request_heap_update();
    if (this->energy_consumption_sensor_ != nullptr)
      this->request_energy_consumption_update();
    if (this->total_energy_consumption_sensor_ != nullptr)
      this->request_total_energy_consumption_update();
    if (this->voltage_l1_sensor_ != nullptr || this->voltage_l2_sensor_ != nullptr ||
        this->voltage_l3_sensor_ != nullptr)
      this->request_voltage_update();
    if (this->current_l1_sensor_ != nullptr || this->current_l2_sensor_ != nullptr ||
        this->current_l3_sensor_ != nullptr)
      this->request_current_update();
    if (this->wifi_rssi_sensor_ != nullptr || this->wifi_connected_binary_sensor_ != nullptr)
      this->request_wifi_status_update();
    if (this->charging_limit_reached_binary_sensor_ != nullptr)
      this->request_charging_limit_reached_update();
    if (this->default_charging_current_number_ != nullptr)
      this->request_default_charging_current_update();
    if (this->maximum_charging_current_number_ != nullptr)
      this->request_maximum_charging_current_update();
    if (this->consumption_limit_number_ != nullptr)
      this->request_consumption_limit_update();
    if (this->default_consumption_limit_number_ != nullptr)
      this->request_default_consumption_limit_update();
    if (this->charging_time_limit_number_ != nullptr)
      this->request_charging_time_limit_update();
    if (this->default_charging_time_limit_number_ != nullptr)
      this->request_default_charging_time_limit_update();
    if (this->under_power_limit_number_ != nullptr)
      this->request_under_power_limit_update();
    if (this->default_under_power_limit_number_ != nullptr)
      this->request_default_under_power_limit_update();
  });
}

// Process incoming UART bytes and drive the command queue.  This keeps the ESPHome
// scheduler responsive even while waiting for EVSE acknowledgements.
void ESP32EVSEComponent::loop() {
  uint8_t rx_buffer[kRxChunkSize];
  while (this->available()) {
    size_t available = this->available();
    if (available == 0)
      break;
    size_t to_read = std::min(available, kRxChunkSize);
    this->read_array(rx_buffer, to_read);
    for (size_t i = 0; i < to_read; ++i) {
      char c = static_cast<char>(rx_buffer[i]);
      if (c == '\n' || c == '\r') {
        if (!this->read_buffer_.empty()) {
          this->process_line_(this->read_buffer_);
          this->read_buffer_.clear();
        }
      } else {
        this->read_buffer_.push_back(c);
        if (this->read_buffer_.size() > kMaxLineLength) {
          ESP_LOGW(TAG, "Line too long (%zu), discarding partial data", this->read_buffer_.size());
          this->read_buffer_.clear();
        }
      }
    }
  }

  const uint32_t now = millis();
  while (!this->pending_commands_.empty()) {
    auto &front = this->pending_commands_.front();
    if (!front.sent) {
      this->process_next_command_();
      break;
    }
    if (now - front.start_time < 5000) {
      break;
    }
    ESP_LOGW(TAG, "Command '%s' timed out", front.command.c_str());
    if (this->timeout_fault_binary_sensor_ != nullptr) {
      this->timeout_fault_binary_sensor_->publish_state(true);
    }
    this->handle_ack_(false, true);
  }
}

// Remember when the EVSE last answered a query.  Fresh slots allow the periodic
// updater to skip issuing another AT command when subscription data already
// delivered a recent value.
void ESP32EVSEComponent::mark_response_received_(FreshnessSlot slot) {
  size_t index = static_cast<size_t>(slot);
  if (index >= this->last_response_millis_.size())
    return;
  this->last_response_millis_[index] = millis();
}

// Return ``true`` when the most recent response in ``slot`` is still within the
// freshness window (half of the configured polling interval).  Callers can then
// skip sending duplicate commands and keep the UART queue short for sensors that
// require a full round trip.
bool ESP32EVSEComponent::should_skip_poll_(FreshnessSlot slot) const {
  size_t index = static_cast<size_t>(slot);
  if (index >= this->last_response_millis_.size())
    return false;
  uint32_t last = this->last_response_millis_[index];
  if (last == 0)
    return false;
  uint32_t interval = this->get_update_interval();
  if (interval == 0)
    interval = kDefaultUpdateIntervalMs;
  if (interval < kMinUpdateIntervalMs)
    interval = kMinUpdateIntervalMs;
  if (interval > kMaxUpdateIntervalMs)
    interval = kMaxUpdateIntervalMs;
  uint32_t freshness_window = interval / 2;
  if (freshness_window == 0)
    freshness_window = 1;
  uint32_t now_ms = millis();
  uint32_t elapsed = now_ms - last;
  return elapsed < freshness_window;
}

