nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
// Thin wrappers that enqueue the corresponding AT command.  Keeping them in one
// place makes it easy to audit which controller features we query.
void ESP32EVSEComponent::request_state_update() { this->send_command_("AT+STATE?"); }
void ESP32EVSEComponent::request_enable_update() { this->send_command_("AT+ENABLE?"); }
void ESP32EVSEComponent::request_temperature_update() { this->send_command_("AT+TEMP?"); }
void ESP32EVSEComponent::request_charging_current_update() { this->send_command_("AT+CHCUR?"); }
void ESP32EVSEComponent::request_emeter_power_update() { this->send_command_("AT+EMETERPOWER?"); }
void ESP32EVSEComponent::request_emeter_session_time_update() {
  this->send_command_("AT+EMETERSESTIME?");
}
void ESP32EVSEComponent::request_emeter_charging_time_update() {
  this->send_command_("AT+EMETERCHTIME?");
}
void ESP32EVSEComponent::request_uptime_update() { this->send_command_("AT+UPTIME?"); }
void ESP32EVSEComponent::request_chip_update() { this->send_command_("AT+CHIP?"); }
void ESP32EVSEComponent::request_version_update() { this->send_command_("AT+VER?"); }
void ESP32EVSEComponent::request_idf_version_update() { this->send_command_("AT+IDFVER?"); }
void ESP32EVSEComponent::request_build_time_update() { this->send_command_("AT+BUILDTIME?"); }
void ESP32EVSEComponent::request_device_time_update() { this->send_command_("AT+TIME?"); }
void ESP32EVSEComponent::request_wifi_sta_cfg_update() { this->send_command_("AT+WIFISTACFG?"); }
void ESP32EVSEComponent::request_wifi_sta_ip_update() { this->send_command_("AT+WIFISTAIP?"); }
void ESP32EVSEComponent::request_wifi_sta_mac_update() { this->send_command_("AT+WIFISTAMAC?"); }
void ESP32EVSEComponent::request_device_name_update() { this->send_command_("AT+DEVNAME?"); }
void ESP32EVSEComponent::request_available_update() { this->send_command_("AT+AVAILABLE?"); }
void ESP32EVSEComponent::request_request_authorization_update() {
  this->send_command_("AT+REQAUTH?");
}
void ESP32EVSEComponent::request_emeter_three_phase_update() {
  this->send_command_("AT+EMETERTHREEPHASE?");
}
void ESP32EVSEComponent::request_heap_update() { this->send_command_("AT+HEAP?"); }
void ESP32EVSEComponent::request_energy_consumption_update() {
  this->send_command_("AT+EMETERCONSUM?");
}
void ESP32EVSEComponent::request_total_energy_consumption_update() {
  this->send_command_("AT+EMETERTOTCONSUM?");
}
void ESP32EVSEComponent::request_voltage_update() { this->send_command_("AT+EMETERVOLTAGE?"); }
void ESP32EVSEComponent::request_current_update() { this->send_command_("AT+EMETERCURRENT?"); }
void ESP32EVSEComponent::request_wifi_status_update() { this->send_command_("AT+WIFISTACONN?"); }
void ESP32EVSEComponent::request_default_charging_current_update() {
  this->send_command_("AT+DEFCHCUR?");
}
void ESP32EVSEComponent::request_maximum_charging_current_update() {
  this->send_command_("AT+MAXCHCUR?");
}
void ESP32EVSEComponent::request_consumption_limit_update() {
  this->send_command_("AT+CONSUMLIM?");
}
void ESP32EVSEComponent::request_default_consumption_limit_update() {
  this->send_command_("AT+DEFCONSUMLIM?");
}
void ESP32EVSEComponent::request_charging_time_limit_update() {
  this->send_command_("AT+CHTIMELIM?");
}
void ESP32EVSEComponent::request_default_charging_time_limit_update() {
  this->send_command_("AT+DEFCHTIMELIM?");
}
void ESP32EVSEComponent::request_under_power_limit_update() {
  this->send_command_("AT+UNDERPOWERLIM?");
}
void ESP32EVSEComponent::request_default_under_power_limit_update() {
  this->send_command_("AT+DEFUNDERPOWERLIM?");
}
void ESP32EVSEComponent::request_pending_authorization_update() {
  this->send_command_("AT+PENDAUTH?");
}
void ESP32EVSEComponent::request_charging_limit_reached_update() {
  this->send_command_("AT+LIMREACH?");
}

void ESP32EVSEComponent::request_error_flags_update() { this->send_command_("AT+ERROR?"); }

// Translate ESPHome entity state changes into AT commands.
void ESP32EVSEComponent::write_enable_state(bool enabled) {
  PendingCommand pending;
  pending.type = PendingCommand::Type::ENABLE_WRITE;
  // Remember the requested state so we can publish it once the EVSE confirms
  // the write.
  pending.bool_value = enabled;
  pending.command.assign("AT+ENABLE=");
  pending.command.append_char(enabled ? '1' : '0');
  this->queue_pending_command_(pending);
}

void ESP32EVSEComponent::write_available_state(bool available) {
  PendingCommand pending;
  pending.type = PendingCommand::Type::AVAILABLE_WRITE;
  // Store the intended availability state so the acknowledgement handler can
  // publish it instead of the optimistic toggle response.
  pending.bool_value = available;
  pending.command.assign("AT+AVAILABLE=");
  pending.command.append_char(available ? '1' : '0');
  this->queue_pending_command_(pending);
}

void ESP32EVSEComponent::write_request_authorization_state(bool request) {
  PendingCommand pending;
  pending.type = PendingCommand::Type::REQUEST_AUTHORIZATION_WRITE;
  // Persist the desired authorization request flag to publish after a
  // successful acknowledgement.
  pending.bool_value = request;
  pending.command.assign("AT+REQAUTH=");
  pending.command.append_char(request ? '1' : '0');
  this->queue_pending_command_(pending);
}

void ESP32EVSEComponent::write_emeter_three_phase_state(bool enabled) {
  PendingCommand pending;
  pending.type = PendingCommand::Type::EMETER_THREE_PHASE_WRITE;
  pending.bool_value = enabled;
  pending.command.assign("AT+EMETERTHREEPHASE=");
  pending.command.append_char(enabled ? '1' : '0');
  this->queue_pending_command_(pending);
}

void ESP32EVSEComponent::write_charging_current(float current) {
  this->write_number_value(this->charging_current_number_, current);
}

float ESP32EVSEComponent::clamp_charging_current_value(ESP32EVSEChargingCurrentNumber *number, float value) const {
  if ((number == this->charging_current_number_ || number == this->default_charging_current_number_) &&
      !std::isnan(this->maximum_charging_current_limit_)) {
    // The EVSE only accepts runtime values up to the reported maximum, so cap writes accordingly.
    if (value > this->maximum_charging_current_limit_)
      value = this->maximum_charging_current_limit_;
  }
  return value;
}

void ESP32EVSEComponent::write_number_value(ESP32EVSEChargingCurrentNumber *number, float value) {
  if (number == nullptr)
    return;
  const std::string &command = number->get_command();
  if (command.empty())
    return;
  value = this->clamp_charging_current_value(number, value);
  float scaled_value = value * number->get_multiplier();
  int32_t to_send = static_cast<int32_t>(std::lroundf(scaled_value));
  PendingCommand pending;
  pending.type = PendingCommand::Type::NUMBER_WRITE;
  // Retain the target entity and scaled integer the firmware expects so the
  // acknowledgement handler can publish the same reading once the write sticks.
  pending.number = number;
  pending.scaled_value = static_cast<float>(to_send);
  pending.command.assign(command);
  pending.command.append_char('=');
  pending.command.append_decimal(to_send);
  this->queue_pending_command_(pending);
}

// Convenience wrappers for popular subscription targets.  They are exposed to
// users through templated buttons in YAML.
void ESP32EVSEComponent::at_sub(const std::string &command, uint32_t period_ms) {
  if (!this->is_valid_subscription_argument_(command)) {
    ESP_LOGW(TAG,
             "Rejected AT+SUB wrapper request with argument '%s'; only subscription targets are allowed",
             command.c_str());
    return;
  }
  ESP_LOGD(TAG, "Sending AT+SUB for command '%s' with period %" PRIu32 " ms", command.c_str(), period_ms);
  CommandString cmd;
  cmd.assign("AT+SUB=");
  cmd.append(command);
  cmd.append_char(',');
  cmd.append_unsigned(period_ms);
  this->send_command_(cmd);
}

