nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
void ESP32EVSEComponent::at_unsub(const std::string &command) {
  if (command.empty()) {
    ESP_LOGD(TAG, "Sending AT+UNSUB with empty command parameter");
    CommandString cmd;
    cmd.assign("AT+UNSUB=\"\"");
    this->send_command_(cmd);
    return;
  }

  if (!this->is_valid_subscription_argument_(command)) {
    ESP_LOGW(TAG,
             "Rejected AT+UNSUB wrapper request with argument '%s'; only subscription targets are allowed",
             command.c_str());
    return;
  }

  ESP_LOGD(TAG, "Sending AT+UNSUB for command '%s'", command.c_str());
  CommandString cmd;
  cmd.assign("AT+UNSUB=");
  cmd.append(command);
  this->send_command_(cmd);
}

// Validate that a subscription string only contains characters supported by the
// EVSE firmware (alphanumeric, plus, underscore, and quotes).
bool ESP32EVSEComponent::is_valid_subscription_argument_(const std::string &argument) const {
  if (argument.empty()) {
    return false;
  }
  for (size_t i = 0; i + 2 < argument.size(); ++i) {
    char c0 = argument[i];
    char c1 = argument[i + 1];
    char c2 = argument[i + 2];
    if ((c0 == 'A' || c0 == 'a') && (c1 == 'T' || c1 == 't') && c2 == '+') {
      return false;
    }
  }
  return true;
}

void ESP32EVSEComponent::send_reset_command() { this->send_command_("AT+RST"); }

void ESP32EVSEComponent::send_authorize_command() { this->send_command_("AT+AUTH"); }

void ESP32EVSEComponent::send_start_ap_command() { this->send_command_("AT+WIFIAPCFG=1"); }

bool ESP32EVSEComponent::send_command_(const char *command) {
  if (command == nullptr || command[0] == '\0')
    return false;
  PendingCommand pending;
  pending.command.assign(command);
  this->queue_pending_command_(pending);
  return true;
}

bool ESP32EVSEComponent::send_command_(const CommandString &command) {
  if (command.size() == 0)
    return false;
  PendingCommand pending;
  pending.command = command;
  this->queue_pending_command_(pending);
  return true;
}

void ESP32EVSEComponent::queue_pending_command_(const PendingCommand &pending) {
  ESP_LOGV(TAG, "Queueing command: %s", pending.command.c_str());
  // Track each command so we only send one request at a time and can associate
  // the eventual OK/ERROR response with the original metadata.
  const bool prioritize_interactive = pending.type != PendingCommand::Type::GENERIC;

  bool enqueued = false;
  if (!prioritize_interactive || this->pending_commands_.empty()) {
    enqueued = this->pending_commands_.push_back(pending);
  } else {
    size_t insert_index = 0;
    if (this->pending_commands_.front().sent)
      insert_index = 1;  // Keep the command currently waiting for an ACK at the front.

    for (; insert_index < this->pending_commands_.size(); ++insert_index) {
      const auto &candidate = this->pending_commands_[insert_index];
      if (!candidate.sent && candidate.type == PendingCommand::Type::GENERIC)
        break;
    }
    enqueued = this->pending_commands_.insert(insert_index, pending);
  }
  if (!enqueued) {
    ESP_LOGW(TAG, "Pending command queue full, dropping '%s'", pending.command.c_str());
    return;
  }
  this->process_next_command_();
}

bool ESP32EVSEComponent::is_front_sent_write_(PendingCommand::Type type,
                                              ESP32EVSEChargingCurrentNumber *number) const {
  if (this->pending_commands_.empty())
    return false;
  const auto &front = this->pending_commands_.front();
  if (!front.sent)
    return false;
  if (front.type != type)
    return false;
  if (type == PendingCommand::Type::NUMBER_WRITE && front.number != number)
    return false;
  // Only treat the front command as a pending write if we've already pushed it
  // to the EVSE and the metadata matches the entity currently updating.
  return true;
}

// Parse a single line returned by the EVSE and dispatch to the appropriate
// update handler.  The protocol is a mix of ``+KEY=VALUE`` lines and asynchronous
// ``OK``/``ERROR`` acknowledgements.
void ESP32EVSEComponent::process_line_(const std::string &line) {
  ESP_LOGV(TAG, "Received line: %s", line.c_str());
  if (line == "OK") {
    this->handle_ack_(true, false);
    return;
  }
  if (line == "ERROR") {
    ESP_LOGW(TAG, "ESP32-EVSE error response received");
    this->handle_ack_(false, false);
    return;
  }
  if (line == "RDY") {
    ESP_LOGI(TAG, "ESP32-EVSE ready to accept commands");
    this->ready_trigger_.trigger();
    return;
  }
  if (const char *value = value_after_prefix(line, "+STATE")) {
    int state_value = atoi(value);
    this->update_state_(state_value);
    return;
  }
  if (const char *value = value_after_prefix(line, "+ENABLE")) {
    int enable_value = atoi(value);
    this->update_enable_(enable_value == 1);
    return;
  }
  if (const char *value = value_after_prefix(line, "+TEMP")) {
    int count = 0;
    int32_t high = 0;
    int32_t low = 0;
    if (sscanf(value, "%d,%" PRIi32 ",%" PRIi32, &count, &high, &low) == 3) {
      this->update_temperature_(count, high, low);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+CHCUR")) {
    int chcur_value = atoi(value);
    if (chcur_value >= 0)
      this->update_charging_current_(static_cast<uint16_t>(chcur_value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERPOWER")) {
    uint32_t power = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_emeter_power_(power);
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERSESTIME")) {
    uint32_t time = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_emeter_session_time_(time);
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERCHTIME")) {
    uint32_t time = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_emeter_charging_time_(time);
    return;
  }
  if (const char *value = value_after_prefix(line, "+UPTIME")) {
    uint32_t seconds = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_uptime_(seconds);
    return;
  }
  if (const char *value = value_after_prefix(line, "+CHIP")) {
    std::string_view chip_info = trim_view(value);
    std::string_view chip_name = nth_trimmed_token(chip_info, 0);
    if (chip_name.empty())
      chip_name = chip_info;

    std::string formatted(chip_name);
    std::string_view chip_cores = nth_trimmed_token(chip_info, 1);
    if (!chip_cores.empty()) {
      int cores = 0;
      auto parse_result = std::from_chars(chip_cores.data(), chip_cores.data() + chip_cores.size(), cores);
      if (parse_result.ec != std::errc())
        cores = 0;
      if (cores > 0)
        formatted += ", " + std::to_string(cores) + (cores == 1 ? " core" : " cores");
    }

