nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
    this->update_chip_(formatted);
    return;
  }
  if (const char *value = value_after_prefix(line, "+VER")) {
    this->update_version_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+IDFVER")) {
    this->update_idf_version_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+BUILDTIME")) {
    this->update_build_time_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+TIME")) {
    uint32_t timestamp = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_device_time_(timestamp);
    return;
  }
  if (const char *value = value_after_prefix(line, "+WIFISTACFG")) {
    std::string_view wifi_cfg = trim_view(value);
    std::string_view ssid = nth_trimmed_token(wifi_cfg, 1);
    if (ssid.empty())
      ssid = wifi_cfg;
    this->update_wifi_sta_cfg_(std::string(ssid));
    return;
  }
  if (const char *value = value_after_prefix(line, "+WIFISTAIP")) {
    this->update_wifi_sta_ip_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+WIFISTAMAC")) {
    this->update_wifi_sta_mac_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+DEVNAME")) {
    this->update_device_name_(trim_copy(value));
    return;
  }
  if (const char *value = value_after_prefix(line, "+AVAILABLE")) {
    int available = atoi(value);
    this->update_available_(available == 1);
    return;
  }
  if (const char *value = value_after_prefix(line, "+REQAUTH")) {
    int req = atoi(value);
    this->update_request_authorization_(req == 1);
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERTHREEPHASE")) {
    int enabled = atoi(value);
    this->update_emeter_three_phase_(enabled == 1);
    return;
  }
  if (const char *value = value_after_prefix(line, "+HEAP")) {
    const char *cursor = value;
    char *endptr = nullptr;
    bool has_used = false;
    bool has_total = false;
    uint32_t heap_used = 0;
    uint32_t heap_total = 0;

    unsigned long parsed = strtoul(cursor, &endptr, 10);
    if (endptr != cursor) {
      heap_used = static_cast<uint32_t>(parsed);
      has_used = true;
      cursor = endptr;

      while (*cursor != '\0' && isspace(static_cast<unsigned char>(*cursor)))
        ++cursor;
      if (*cursor == ',') {
        ++cursor;
        while (*cursor != '\0' && isspace(static_cast<unsigned char>(*cursor)))
          ++cursor;
        parsed = strtoul(cursor, &endptr, 10);
        if (endptr != cursor) {
          heap_total = static_cast<uint32_t>(parsed);
          has_total = true;
        }
      }
    }

    if (has_used || has_total) {
      this->update_heap_(has_used ? std::optional<uint32_t>(heap_used) : std::nullopt,
                         has_total ? std::optional<uint32_t>(heap_total) : std::nullopt);
    } else {
      ESP_LOGW(TAG, "Unable to parse heap values from '%s'", value);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERCONSUM")) {
    float consum = strtof(value, nullptr);
    this->update_energy_consumption_(consum);
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERTOTCONSUM")) {
    float consum = parse_last_float(value);
    if (std::isnan(consum)) {
      ESP_LOGW(TAG, "Unable to parse total energy consumption from '%s'", value);
    } else {
      this->update_total_energy_consumption_(consum);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERVOLTAGE")) {
    float l1 = NAN;
    float l2 = NAN;
    float l3 = NAN;
    if (sscanf(value, "%f,%f,%f", &l1, &l2, &l3) == 3) {
      // The EVSE reports the three phase voltages in a single response.  That
      // holds both for polled replies (``AT+EMETERVOLTAGE?``) and for
      // subscription streams started with ``AT+SUB`` where the controller
      // pushes updates on its own, so all three entities are published
      // back-to-back from the same UART line.
      this->update_voltages_(l1, l2, l3);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+EMETERCURRENT")) {
    float l1 = NAN;
    float l2 = NAN;
    float l3 = NAN;
    if (sscanf(value, "%f,%f,%f", &l1, &l2, &l3) == 3) {
      // Similarly for the phase currents: whether they arrive as a response to
      // ``AT+EMETERCURRENT?`` or as part of a subscription stream, the EVSE
      // delivers the three measurements together, so their publish timestamps
      // only differ by the bookkeeping time inside this callback.
      this->update_currents_(l1, l2, l3);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+WIFISTACONN")) {
    int connected = 0;
    int rssi = std::numeric_limits<int>::min();
    int parsed = sscanf(value, "%d,%d", &connected, &rssi);
    if (parsed >= 1) {
      if (parsed < 2) {
        rssi = std::numeric_limits<int>::min();
      }
      this->update_wifi_status_(connected == 1, rssi);
    }
    return;
  }
  if (const char *value = value_after_prefix(line, "+DEFCHCUR")) {
    int val = atoi(value);
    this->update_default_charging_current_(static_cast<uint16_t>(val));
    return;
  }
  if (const char *value = value_after_prefix(line, "+MAXCHCUR")) {
    int val = atoi(value);
    this->update_maximum_charging_current_(static_cast<uint16_t>(val));
    return;
  }
  if (const char *value = value_after_prefix(line, "+CONSUMLIM")) {
    float val = strtof(value, nullptr);
    this->update_consumption_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+DEFCONSUMLIM")) {
    float val = strtof(value, nullptr);
    this->update_default_consumption_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+CHTIMELIM")) {
    uint32_t val = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_charging_time_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+DEFCHTIMELIM")) {
    uint32_t val = static_cast<uint32_t>(strtoul(value, nullptr, 10));
    this->update_default_charging_time_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+UNDERPOWERLIM")) {
    float val = strtof(value, nullptr);
    this->update_under_power_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+DEFUNDERPOWERLIM")) {
    float val = strtof(value, nullptr);
    this->update_default_under_power_limit_(val);
    return;
  }
  if (const char *value = value_after_prefix(line, "+LIMREACH")) {
    int val = atoi(value);
    this->update_charging_limit_reached_(val == 1);
    return;
  }
  if (const char *value = value_after_prefix(line, "+ERROR")) {
    uint32_t mask = static_cast<uint32_t>(strtoul(value, nullptr, 0));
    this->update_error_flags_(mask);
    return;
  }
  if (const char *value = value_after_prefix(line, "+PENDAUTH")) {
    int val = atoi(value);
    this->update_pending_authorization_(val == 1);
    return;
  }

  ESP_LOGD(TAG, "Unhandled line: %s", line.c_str());
}

// Called after receiving an ``OK`` or ``ERROR`` response for the oldest pending
// command.
void ESP32EVSEComponent::handle_ack_(bool success, bool timed_out) {
  if (this->pending_commands_.empty()) {
    ESP_LOGW(TAG, "Received %s without pending command", success ? "OK" : "ERROR");
    return;
  }
  PendingCommand pending = this->pending_commands_.front();
  this->pending_commands_.pop_front();
  ESP_LOGV(TAG, "Command '%s' completed with %s", pending.command.c_str(), success ? "OK" : "ERROR");
  if (!timed_out && this->timeout_fault_binary_sensor_ != nullptr) {
    this->timeout_fault_binary_sensor_->publish_state(false);
  }
  switch (pending.type) {
    case PendingCommand::Type::ENABLE_WRITE:
      if (this->enable_switch_ != nullptr) {
        if (success) {
          this->enable_switch_->publish_state(pending.bool_value);
        } else {
          this->enable_switch_->publish_state(!pending.bool_value);
        }
      }
      break;
    case PendingCommand::Type::AVAILABLE_WRITE:
      if (this->available_switch_ != nullptr) {
        if (success) {
          this->available_switch_->publish_state(pending.bool_value);
        } else {
          this->request_available_update();
        }
      }
      break;
    case PendingCommand::Type::REQUEST_AUTHORIZATION_WRITE:
      if (this->request_authorization_switch_ != nullptr) {
        if (success) {
          this->request_authorization_switch_->publish_state(pending.bool_value);
        } else {
          this->request_request_authorization_update();
        }
      }
      break;
    case PendingCommand::Type::EMETER_THREE_PHASE_WRITE:
      if (this->emeter_three_phase_switch_ != nullptr) {
        if (success) {
          this->emeter_three_phase_switch_->publish_state(pending.bool_value);
        } else {
          this->request_emeter_three_phase_update();
        }
      }
      break;
    case PendingCommand::Type::NUMBER_WRITE:
      if (pending.number != nullptr) {
        if (success) {
          this->publish_scaled_number_(pending.number, pending.scaled_value);
        } else {
          this->request_number_update_(pending.number);
        }
      }
      break;
    case PendingCommand::Type::GENERIC:
      break;
  }
  this->process_next_command_();
}

