nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
// Send the next queued command if we are not already waiting for a reply.
void ESP32EVSEComponent::process_next_command_() {
  if (this->pending_commands_.empty())
    return;

  auto &front = this->pending_commands_.front();
  if (front.sent)
    return;

  ESP_LOGV(TAG, "Sending command: %s", front.command.c_str());
  this->write_str(front.command.c_str());
  this->write_str("\n");
  front.start_time = millis();
  front.sent = true;
}

// Publish EVSE state machine codes (A/B/C/etc.) to the bound text sensor.
void ESP32EVSEComponent::update_state_(uint8_t state) {
  this->mark_response_received_(FreshnessSlot::STATE);
  static const char *const STATE_NAMES[] = {"A", "B1", "B2", "C1", "C2", "D1", "D2", "E", "F"};
  const char *state_name = "UNKNOWN";
  if (state < sizeof(STATE_NAMES) / sizeof(STATE_NAMES[0])) {
    state_name = STATE_NAMES[state];
  }
  this->publish_text_sensor_state_(this->state_text_sensor_, state_name);
}

// Mirror EVSE flags back into ESPHome entities.
void ESP32EVSEComponent::update_enable_(bool enable) {
  this->mark_response_received_(FreshnessSlot::ENABLE);
  // Ignore subscription echoes while a matching command is awaiting an
  // acknowledgement so we only flip the switch state once.
  if (this->is_front_sent_write_(PendingCommand::Type::ENABLE_WRITE))
    return;
  if (this->enable_switch_ != nullptr) {
    this->enable_switch_->publish_state(enable);
  }
}

// Publish the EVSE's reported temperature extremes.  Values are sent in
// centi-degrees, so we convert to Celsius before forwarding them.
void ESP32EVSEComponent::update_temperature_(int count, int32_t high, int32_t low) {
  this->mark_response_received_(FreshnessSlot::TEMPERATURE);
  if (this->temperature_high_sensor_ == nullptr && this->temperature_low_sensor_ == nullptr)
    return;
  if (count <= 0) {
    if (this->temperature_high_sensor_ != nullptr)
      this->temperature_high_sensor_->publish_state(NAN);
    if (this->temperature_low_sensor_ != nullptr)
      this->temperature_low_sensor_->publish_state(NAN);
    return;
  }
  float high_c = high / 100.0f;
  float low_c = low / 100.0f;
  if (this->temperature_high_sensor_ != nullptr)
    this->temperature_high_sensor_->publish_state(high_c);
  if (this->temperature_low_sensor_ != nullptr)
    this->temperature_low_sensor_->publish_state(low_c);
}

// Helper: convert the raw integer value reported by the EVSE into the scaled
// float the number entity expects before publishing it.
void ESP32EVSEComponent::publish_scaled_number_(ESP32EVSEChargingCurrentNumber *number, float raw_value) {
  if (number == nullptr)
    return;
  if (this->is_front_sent_write_(PendingCommand::Type::NUMBER_WRITE, number))
    return;
  // Convert the EVSE's integer back into the human-friendly engineering units
  // expected by the ESPHome number entity before reporting it.
  float multiplier = number->get_multiplier();
  if (multiplier == 0.0f)
    multiplier = 1.0f;
  float value = raw_value / multiplier;
  number->publish_state(value);
}

// Helper: only publish text sensor updates when the value actually changes to
// avoid unnecessary state spam for subscribers.
void ESP32EVSEComponent::publish_text_sensor_state_(text_sensor::TextSensor *sensor,
                                                    const std::string &state) {
  if (sensor == nullptr)
    return;
  if (sensor->has_state() && sensor->state == state)
    return;
  sensor->publish_state(state);
}

bool ESP32EVSEComponent::has_error_binary_sensors_() const {
  return this->pilot_fault_binary_sensor_ != nullptr ||
         this->diode_short_binary_sensor_ != nullptr ||
         this->lock_fault_binary_sensor_ != nullptr ||
         this->unlock_fault_binary_sensor_ != nullptr ||
         this->rcm_triggered_binary_sensor_ != nullptr ||
         this->rcm_self_test_fault_binary_sensor_ != nullptr ||
         this->temperature_high_fault_binary_sensor_ != nullptr ||
         this->temperature_fault_binary_sensor_ != nullptr;
}

void ESP32EVSEComponent::update_charging_current_(uint16_t value_tenths) {
  this->mark_response_received_(FreshnessSlot::CHARGING_CURRENT);
  this->publish_scaled_number_(this->charging_current_number_, value_tenths);
}

void ESP32EVSEComponent::update_emeter_power_(uint32_t power_w) {
  this->mark_response_received_(FreshnessSlot::EMETER_POWER);
  if (this->emeter_power_sensor_ != nullptr) {
    this->emeter_power_sensor_->publish_state(power_w);
  }
}

void ESP32EVSEComponent::update_emeter_session_time_(uint32_t time_s) {
  this->mark_response_received_(FreshnessSlot::EMETER_SESSION_TIME);
  if (this->emeter_session_time_sensor_ != nullptr) {
    this->emeter_session_time_sensor_->publish_state(time_s);
  }
}

void ESP32EVSEComponent::update_emeter_charging_time_(uint32_t time_s) {
  this->mark_response_received_(FreshnessSlot::EMETER_CHARGING_TIME);
  if (this->emeter_charging_time_sensor_ != nullptr) {
    this->emeter_charging_time_sensor_->publish_state(time_s);
  }
}

void ESP32EVSEComponent::update_uptime_(uint32_t seconds) {
  this->mark_response_received_(FreshnessSlot::UPTIME);
  if (this->uptime_sensor_ != nullptr) {
    this->uptime_sensor_->publish_state(seconds);
  }
}

void ESP32EVSEComponent::update_chip_(const std::string &chip) {
  this->mark_response_received_(FreshnessSlot::CHIP);
  this->publish_text_sensor_state_(this->chip_text_sensor_, chip);
}

void ESP32EVSEComponent::update_version_(const std::string &version) {
  this->mark_response_received_(FreshnessSlot::VERSION);
  this->publish_text_sensor_state_(this->version_text_sensor_, version);
}

void ESP32EVSEComponent::update_idf_version_(const std::string &idf_version) {
  this->mark_response_received_(FreshnessSlot::IDF_VERSION);
  this->publish_text_sensor_state_(this->idf_version_text_sensor_, idf_version);
}

void ESP32EVSEComponent::update_build_time_(const std::string &build_time) {
  this->mark_response_received_(FreshnessSlot::BUILD_TIME);
  if (this->build_time_text_sensor_ == nullptr)
    return;
  std::string sanitized = build_time;
  size_t pos = 0;
  while ((pos = sanitized.find('"', pos)) != std::string::npos) {
    sanitized.erase(pos, 1);
  }
  this->publish_text_sensor_state_(this->build_time_text_sensor_, sanitized);
}

void ESP32EVSEComponent::update_device_time_(uint32_t timestamp) {
  this->mark_response_received_(FreshnessSlot::DEVICE_TIME);
  if (this->device_time_text_sensor_ == nullptr)
    return;
  time_t raw_time = static_cast<time_t>(timestamp);
  struct tm tm_info;
  if (!localtime_r(&raw_time, &tm_info)) {
    this->publish_text_sensor_state_(this->device_time_text_sensor_, "invalid");
    return;
  }
  char buffer[32];
  if (strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M", &tm_info) == 0) {
    this->publish_text_sensor_state_(this->device_time_text_sensor_, "invalid");
    return;
  }
  this->publish_text_sensor_state_(this->device_time_text_sensor_, buffer);
}

