nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
void ESP32EVSEComponent::update_wifi_sta_cfg_(const std::string &ssid) {
  this->mark_response_received_(FreshnessSlot::WIFI_STA_CFG);
  this->publish_text_sensor_state_(this->wifi_sta_ssid_text_sensor_, ssid);
}

void ESP32EVSEComponent::update_wifi_sta_ip_(const std::string &ip) {
  this->mark_response_received_(FreshnessSlot::WIFI_STA_IP);
  this->publish_text_sensor_state_(this->wifi_sta_ip_text_sensor_, ip);
}

void ESP32EVSEComponent::update_wifi_sta_mac_(const std::string &mac) {
  this->mark_response_received_(FreshnessSlot::WIFI_STA_MAC);
  this->publish_text_sensor_state_(this->wifi_sta_mac_text_sensor_, mac);
}

void ESP32EVSEComponent::update_device_name_(const std::string &name) {
  this->mark_response_received_(FreshnessSlot::DEVICE_NAME);
  this->publish_text_sensor_state_(this->device_name_text_sensor_, name);
}

void ESP32EVSEComponent::update_available_(bool available) {
  this->mark_response_received_(FreshnessSlot::AVAILABLE);
  // Defer publishing until the queued write completes to prevent flicker from
  // the immediate subscription update.
  if (this->is_front_sent_write_(PendingCommand::Type::AVAILABLE_WRITE))
    return;
  if (this->available_switch_ != nullptr) {
    this->available_switch_->publish_state(available);
  }
}

void ESP32EVSEComponent::update_request_authorization_(bool request) {
  this->mark_response_received_(FreshnessSlot::REQUEST_AUTHORIZATION);
  // Hold back the remote state until the command queue confirms the user's
  // desired value.
  if (this->is_front_sent_write_(PendingCommand::Type::REQUEST_AUTHORIZATION_WRITE))
    return;
  if (this->request_authorization_switch_ != nullptr) {
    this->request_authorization_switch_->publish_state(request);
  }
}

void ESP32EVSEComponent::update_emeter_three_phase_(bool enabled) {
  this->mark_response_received_(FreshnessSlot::EMETER_THREE_PHASE);
  if (this->is_front_sent_write_(PendingCommand::Type::EMETER_THREE_PHASE_WRITE))
    return;
  if (this->emeter_three_phase_switch_ != nullptr) {
    this->emeter_three_phase_switch_->publish_state(enabled);
  }
}

void ESP32EVSEComponent::update_heap_(std::optional<uint32_t> heap_used_bytes,
                                      std::optional<uint32_t> heap_total_bytes) {
  this->mark_response_received_(FreshnessSlot::HEAP);
  if (heap_used_bytes.has_value() && this->heap_used_sensor_ != nullptr) {
    this->heap_used_sensor_->publish_state(*heap_used_bytes);
  }
  if (heap_total_bytes.has_value() && this->heap_total_sensor_ != nullptr) {
    this->heap_total_sensor_->publish_state(*heap_total_bytes);
  }
}

void ESP32EVSEComponent::update_energy_consumption_(float value) {
  this->mark_response_received_(FreshnessSlot::ENERGY_CONSUMPTION);
  if (this->energy_consumption_sensor_ != nullptr) {
    this->energy_consumption_sensor_->publish_state(value);
  }
}

void ESP32EVSEComponent::update_total_energy_consumption_(float value) {
  this->mark_response_received_(FreshnessSlot::TOTAL_ENERGY_CONSUMPTION);
  if (this->total_energy_consumption_sensor_ != nullptr) {
    this->total_energy_consumption_sensor_->publish_state(value);
  }
}

void ESP32EVSEComponent::update_voltages_(float l1, float l2, float l3) {
  this->mark_response_received_(FreshnessSlot::VOLTAGE);
  if (!std::isnan(l1))
    l1 /= 1000.0f;
  if (!std::isnan(l2))
    l2 /= 1000.0f;
  if (!std::isnan(l3))
    l3 /= 1000.0f;
  if (this->voltage_l1_sensor_ != nullptr)
    this->voltage_l1_sensor_->publish_state(l1);
  if (this->voltage_l2_sensor_ != nullptr)
    this->voltage_l2_sensor_->publish_state(l2);
  if (this->voltage_l3_sensor_ != nullptr)
    this->voltage_l3_sensor_->publish_state(l3);
}

void ESP32EVSEComponent::update_currents_(float l1, float l2, float l3) {
  this->mark_response_received_(FreshnessSlot::CURRENT);
  if (!std::isnan(l1))
    l1 /= 1000.0f;
  if (!std::isnan(l2))
    l2 /= 1000.0f;
  if (!std::isnan(l3))
    l3 /= 1000.0f;
  if (this->current_l1_sensor_ != nullptr)
    this->current_l1_sensor_->publish_state(l1);
  if (this->current_l2_sensor_ != nullptr)
    this->current_l2_sensor_->publish_state(l2);
  if (this->current_l3_sensor_ != nullptr)
    this->current_l3_sensor_->publish_state(l3);
}

void ESP32EVSEComponent::update_wifi_status_(bool connected, int rssi) {
  this->mark_response_received_(FreshnessSlot::WIFI_STATUS);
  if (this->wifi_connected_binary_sensor_ != nullptr) {
    this->wifi_connected_binary_sensor_->publish_state(connected);
  }
  if (this->wifi_rssi_sensor_ != nullptr) {
    if (connected && rssi != std::numeric_limits<int>::min()) {
      this->wifi_rssi_sensor_->publish_state(rssi);
    } else {
      this->wifi_rssi_sensor_->publish_state(NAN);
    }
  }
}

// Forward various numeric reports from the EVSE to their corresponding number
// entities.  Values are scaled so ESPHome users interact with human readable
// units instead of protocol specific integers.
void ESP32EVSEComponent::update_default_charging_current_(uint16_t value_tenths) {
  this->mark_response_received_(FreshnessSlot::DEFAULT_CHARGING_CURRENT);
  this->publish_scaled_number_(this->default_charging_current_number_, value_tenths);
}

void ESP32EVSEComponent::update_maximum_charging_current_(uint16_t value_amps) {
  this->mark_response_received_(FreshnessSlot::MAXIMUM_CHARGING_CURRENT);
  float limit = static_cast<float>(value_amps);
  if (this->maximum_charging_current_number_ != nullptr) {
    float multiplier = this->maximum_charging_current_number_->get_multiplier();
    if (multiplier == 0.0f)
      multiplier = 1.0f;
    limit = value_amps / multiplier;
  }
  this->maximum_charging_current_limit_ = limit;
  this->publish_scaled_number_(this->maximum_charging_current_number_, value_amps);
}

void ESP32EVSEComponent::update_consumption_limit_(float value) {
  this->mark_response_received_(FreshnessSlot::CONSUMPTION_LIMIT);
  this->publish_scaled_number_(this->consumption_limit_number_, value);
}

void ESP32EVSEComponent::update_default_consumption_limit_(float value) {
  this->mark_response_received_(FreshnessSlot::DEFAULT_CONSUMPTION_LIMIT);
  this->publish_scaled_number_(this->default_consumption_limit_number_, value);
}

