nagyrobi/esp32evse-esphome/components/esp32evse/esp32evse.cpp
void ESP32EVSEComponent::update_charging_time_limit_(uint32_t value) {
  this->mark_response_received_(FreshnessSlot::CHARGING_TIME_LIMIT);
  this->publish_scaled_number_(this->charging_time_limit_number_, static_cast<float>(value));
}

void ESP32EVSEComponent::update_default_charging_time_limit_(uint32_t value) {
  this->mark_response_received_(FreshnessSlot::DEFAULT_CHARGING_TIME_LIMIT);
  this->publish_scaled_number_(this->default_charging_time_limit_number_, static_cast<float>(value));
}

void ESP32EVSEComponent::update_under_power_limit_(float value) {
  this->mark_response_received_(FreshnessSlot::UNDER_POWER_LIMIT);
  this->publish_scaled_number_(this->under_power_limit_number_, value);
}

void ESP32EVSEComponent::update_default_under_power_limit_(float value) {
  this->mark_response_received_(FreshnessSlot::DEFAULT_UNDER_POWER_LIMIT);
  this->publish_scaled_number_(this->default_under_power_limit_number_, value);
}

void ESP32EVSEComponent::update_pending_authorization_(bool pending) {
  this->mark_response_received_(FreshnessSlot::PENDING_AUTHORIZATION);
  if (this->pending_authorization_binary_sensor_ != nullptr) {
    this->pending_authorization_binary_sensor_->publish_state(pending);
  }
}

void ESP32EVSEComponent::update_charging_limit_reached_(bool reached) {
  this->mark_response_received_(FreshnessSlot::CHARGING_LIMIT_REACHED);
  if (this->charging_limit_reached_binary_sensor_ != nullptr) {
    this->charging_limit_reached_binary_sensor_->publish_state(reached);
  }
}

void ESP32EVSEComponent::update_error_flags_(uint32_t mask) {
  this->mark_response_received_(FreshnessSlot::ERROR_FLAGS);
  if (this->pilot_fault_binary_sensor_ != nullptr)
    this->pilot_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_PILOT_FAULT) != 0u);
  if (this->diode_short_binary_sensor_ != nullptr)
    this->diode_short_binary_sensor_->publish_state((mask & ERROR_FLAG_DIODE_SHORT) != 0u);
  if (this->lock_fault_binary_sensor_ != nullptr)
    this->lock_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_LOCK_FAULT) != 0u);
  if (this->unlock_fault_binary_sensor_ != nullptr)
    this->unlock_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_UNLOCK_FAULT) != 0u);
  if (this->rcm_triggered_binary_sensor_ != nullptr)
    this->rcm_triggered_binary_sensor_->publish_state((mask & ERROR_FLAG_RCM_TRIGGERED) != 0u);
  if (this->rcm_self_test_fault_binary_sensor_ != nullptr)
    this->rcm_self_test_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_RCM_SELF_TEST_FAULT) != 0u);
  if (this->temperature_high_fault_binary_sensor_ != nullptr)
    this->temperature_high_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_TEMPERATURE_HIGH) != 0u);
  if (this->temperature_fault_binary_sensor_ != nullptr)
    this->temperature_fault_binary_sensor_->publish_state((mask & ERROR_FLAG_TEMPERATURE_FAULT) != 0u);
}

// When a write command fails we re-request the value so the UI reflects the
// actual charger state.
void ESP32EVSEComponent::request_number_update_(ESP32EVSEChargingCurrentNumber *number) {
  if (number == nullptr)
    return;
  if (number == this->charging_current_number_) {
    this->request_charging_current_update();
  } else if (number == this->default_charging_current_number_) {
    this->request_default_charging_current_update();
  } else if (number == this->maximum_charging_current_number_) {
    this->request_maximum_charging_current_update();
  } else if (number == this->consumption_limit_number_) {
    this->request_consumption_limit_update();
  } else if (number == this->default_consumption_limit_number_) {
    this->request_default_consumption_limit_update();
  } else if (number == this->charging_time_limit_number_) {
    this->request_charging_time_limit_update();
  } else if (number == this->default_charging_time_limit_number_) {
    this->request_default_charging_time_limit_update();
  } else if (number == this->under_power_limit_number_) {
    this->request_under_power_limit_update();
  } else if (number == this->default_under_power_limit_number_) {
    this->request_default_under_power_limit_update();
  }
}

void ESP32EVSEEnableSwitch::write_state(bool state) {
  if (this->parent_ == nullptr)
    return;
  this->parent_->write_enable_state(state);
}

// Switch implementations defer publishing their new state until the EVSE
// acknowledges the change via the component callbacks.
void ESP32EVSEAvailableSwitch::write_state(bool state) {
  if (this->parent_ == nullptr)
    return;
  this->parent_->write_available_state(state);
}

void ESP32EVSERequestAuthorizationSwitch::write_state(bool state) {
  if (this->parent_ == nullptr)
    return;
  this->parent_->write_request_authorization_state(state);
}

void ESP32EVSEEmeterThreePhaseSwitch::write_state(bool state) {
  if (this->parent_ == nullptr)
    return;
  this->parent_->write_emeter_three_phase_state(state);
}

ESP32EVSEChargingCurrentNumber::ESP32EVSEChargingCurrentNumber() {
  this->traits.set_min_value(6.0f);
  this->traits.set_max_value(63.0f);
  this->traits.set_step(0.1f);
}

void ESP32EVSEChargingCurrentNumber::control(float value) {
  if (this->parent_ == nullptr)
    return;
  float limited = this->parent_->clamp_charging_current_value(this, value);
  this->parent_->write_number_value(this, limited);
}

// Buttons translate presses into EVSE commands with no additional state.
void ESP32EVSEResetButton::press_action() {
  if (this->parent_ == nullptr)
    return;
  this->parent_->send_reset_command();
}

void ESP32EVSEAuthorizeButton::press_action() {
  if (this->parent_ == nullptr)
    return;
  this->parent_->send_authorize_command();
}

void ESP32EVSEStartAccessPointButton::press_action() {
  if (this->parent_ == nullptr)
    return;
  this->parent_->send_start_ap_command();
}

}  // namespace esp32evse
}  // namespace esphome
